app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    # render json: user_params # Testing - instead of creating any users, this just returns a response with user_params in json format to check that user_params works
    @user = User.new(user_params)
    if(@user.save)