app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-05-28 17:52:42.906602"], ["id", 1]]
---
  def reset_session_token!
    # self.session_token = generate_unique_session_token
    # self.save
    self.update!(session_token: generate_unique_session_token) # This combines the reassignment with the save to DB.
    self.session_token

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def generate_unique_session_token
    while true
      session_token = SecureRandom.urlsafe_base64 # Or, SecureRandom.base64. urlsafe version can be included in URLs without additional encoding.
      return session_token unless User.find_by(session_token: session_token)